# while迴圈
# 這是條件是迴圈﹐當條件成立時﹐會執行回圈內的程式
i = 1
while i < 10:
    # 當i小於10時，執行回圈內的程式
    print(i)
    i = i + 1

# 算術指定運算子
# +=，-=，*=，/=，%=，**=
# x=x+1等於x+=1
# x=x-1等於x-=1
# x=x*1等於x*=1
# x=x/1等於x/=1
# x=x%1等於x%=1
# x=x**1等於x**=1
# x=x//1等於x//=1

# 符號優先順序
# 1.()先執行括號內的運算式
# 2.**指數運算
# 3.+ -正負號
# 4.* / // % 乘 除 整數除法 取餘數
# 5.+ - 加減
# 6== !=> < >= <=比較運算
# 7and or not邏輯運算子
# 8.= += -= *= /= //= %= **=

i = input("請輸入密碼:")
while i:
    if i == "123456":
        print("密碼正確")
        print("歡迎光臨")
    else:
        print("密碼錯誤")
        i = input("請輸入密碼:")
